---
type: RenderingSettings
namespace: Autodesk.Revit.DB
version: 2024
members: 15
tags: [revit-api, class]
---

# RenderingSettings

`Autodesk.Revit.DB.RenderingSettings` · Revit 2024 · 15 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetBackgroundSettings | 2013 | `public BackgroundSettings GetBackgroundSettings ()` |
| Method | GetRenderingImageExposureSettings | 2013 | `public RenderingImageExposureSettings GetRenderingImageExposureSettings ()` |
| Method | GetRenderingQualitySettings | 2013 | `public RenderingQualitySettings GetRenderingQualitySettings ()` |
| Method | GetRenderingRegionOutline | 2013 | `public Outline GetRenderingRegionOutline ()` |
| Method | SetBackgroundSettings | 2013 | `public void SetBackgroundSettings ( BackgroundSettings background )` |
| Method | SetRenderingImageExposureSettings | 2013 | `public void SetRenderingImageExposureSettings ( RenderingImageExposureSettings exposure )` |
| Method | SetRenderingQualitySettings | 2013 | `public void SetRenderingQualitySettings ( RenderingQualitySettings settings )` |
| Property | BackgroundStyle | 2013 | `public BackgroundStyle BackgroundStyle { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | LightingSource | 2013 | `public LightingSource LightingSource { get ; set ; }` |
| Property | PrinterResolution | 2013 | `public PrinterResolution PrinterResolution { get ; set ; }` |
| Property | ResolutionTarget | 2013 | `public ResolutionTarget ResolutionTarget { get ; set ; }` |
| Property | ResolutionValue | 2013 | `public int ResolutionValue { get ; }` |
| Property | UsesRegionRendering | 2013 | `public bool UsesRegionRendering { get ; set ; }` |